---
kind: method
id: M:Autodesk.Revit.DB.ImageExportOptions.GetViewsAndSheets
source: html/b5e34c47-572e-8901-4b37-6ad86153a67f.htm
---
# Autodesk.Revit.DB.ImageExportOptions.GetViewsAndSheets Method

Gets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.

## Syntax (C#)
```csharp
public IList<ElementId> GetViewsAndSheets()
```

## Returns
The ids of the views and sheets.